[
  {
    "id": "yoga_001",
    "title": "Introduction to Yoga",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "5-8",
    "info": "Yoga is an invaluable gift from India's ancient tradition. It embodies unity of mind and body, thought and action, restraint and fulfillment, harmony between man and nature, and a holistic approach to health and well-being. Yoga is not about exercise but about discovering the sense of oneness with yourself, the world, and nature. The practice leads to the union of individual consciousness with universal consciousness, indicating a perfect harmony between the mind and body. The word 'Yoga' is derived from the Sanskrit root 'Yuj', meaning 'to join' or 'to yoke' or 'to unite'. The practice of Yoga leads to the union of individual consciousness with that of the Universal Consciousness.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_002",
    "title": "Benefits of Regular Yoga Practice",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "9-10",
    "info": "Regular practice of Yoga promotes strength, endurance, flexibility, and facilitates characteristics of friendliness, compassion, and greater self-control, while cultivating a sense of calmness and well-being. Sustained practice also leads to important outcomes such as changes in life perspective, self-awareness, and an improved sense of energy to live life fully and with genuine enjoyment. The practice of Yoga is known to improve flexibility, muscular strength, blood circulation, and energy levels. Yoga helps to reduce stress, anxiety, depression, and chronic pain, helps improve sleep patterns, and enhances overall well-being and quality of life.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_003",
    "title": "Prayer and Invocation (Shanti Mantra)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "11-12",
    "info": "The Common Yoga Protocol begins with a prayer or Shanti Mantra. This invocation creates a peaceful and conducive atmosphere for practice. The prayer acknowledges the divine source of knowledge and seeks blessings for the well-being of all. Chanting 'Om' three times at the beginning creates positive vibrations and prepares the mind and body for the practice ahead. The vibration of Om represents the past, present, and future, encompassing all that exists. This sacred sound is considered the essence of all mantras and connects practitioners to the universal consciousness.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_004",
    "title": "Importance of Breathing in Yoga",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "13-14",
    "info": "Breathing is the foundation of yoga practice. Proper breathing technique increases oxygen supply to the brain and controls the prana (vital life force), thereby controlling the mind and emotions. In yoga, breath is considered the bridge between the body and mind. Conscious breathing helps practitioners remain present and aware during practice. Most people use only a fraction of their lung capacity. Yogic breathing techniques teach full, deep breaths that utilize the entire lung capacity, improving oxygenation of blood and tissues. Coordinating breath with movement enhances the benefits of asanas and creates a meditative quality in practice.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_005",
    "title": "Standing Prayer Pose (Pranamasana)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "15-16",
    "info": "Pranamasana or Prayer Pose is performed while standing erect with feet together. Fold both hands in front of the chest in a prayer position (Namaskara Mudra). Close the eyes and maintain steady breathing. This pose instills a sense of calmness and prepares the mind for practice. Benefits include: Helps in achieving concentration and mental peace, induces a meditative state of mind, improves body balance and posture, strengthens leg muscles and improves stability. The gesture of Namaskara (joining palms) symbolizes bringing together the two hemispheres of the brain, representing the union of opposites and creating inner harmony.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_006",
    "title": "Raised Arms Pose (Urdhva Hastasana)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "17-18",
    "info": "From standing position, raise both arms overhead while inhaling. Keep arms shoulder-width apart or join palms above the head. Stretch the whole body upward while keeping feet flat on the ground. Gaze upward at the hands. Hold for a few breaths. Benefits include: Stretches and tones the abdominal muscles, improves digestion, expands the chest and lungs improving breathing capacity, relieves mild anxiety and fatigue, strengthens shoulders and arms. This pose helps lengthen the spine and improves overall posture. The upward stretch stimulates the digestive organs and helps relieve constipation.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_007",
    "title": "Hand to Foot Pose (Padahastasana)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "19-20",
    "info": "From standing, exhale and bend forward from the hips, bringing the hands down toward the feet. Keep the legs straight or slightly bent at knees if needed. Try to touch the floor beside the feet or hold the ankles. Let the head hang loosely. Benefits: Stretches hamstrings and calf muscles, stimulates liver and kidneys, improves blood circulation to the brain, relieves mental and physical exhaustion, reduces abdominal fat, improves digestion. Pregnant women should not practice deep forward bends. Those with heart conditions should avoid holding this pose for long periods.",
    "precautions": "Contraindications: Avoid if you have severe back problems, sciatica, or high blood pressure. Avoid if you have severe back problems, sciatica, or high blood pressure."
  },
  {
    "id": "yoga_008",
    "title": "Equestrian Pose (Ashwa Sanchalanasana)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "21-22",
    "info": "From forward fold, take the right leg back into a lunge position, resting the knee on the floor. Keep the left leg bent with knee directly over the ankle. Place hands on either side of the left foot. Arch the back and look upward. Benefits: Stretches hip flexors and quadriceps, strengthens leg muscles, improves balance and flexibility in the hips, massages abdominal organs, improves concentration. This pose helps open the chest and improves lung capacity. It's particularly beneficial for those who sit for long hours as it counteracts the effects of prolonged sitting.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_009",
    "title": "Mountain Pose (Parvatasana)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "23-24",
    "info": "From plank position, lift the hips up and back, forming an inverted V shape with the body. Press hands firmly into the floor, straighten the arms and legs. Try to bring heels toward the floor and let the head hang between the arms. Benefits: Strengthens arms, shoulders, and legs, stretches spine and hamstrings, improves blood circulation to the brain, relieves back pain and headaches, energizes the entire body. This pose resembles a mountain and provides stability and strength. It's excellent for relieving fatigue and rejuvenating the body.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_010",
    "title": "Eight Limbs Pose (Ashtanga Namaskara)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "25-26",
    "info": "From plank position, lower the knees, chest, and chin to the floor, keeping the hips slightly raised. Eight parts of the body touch the floor: two feet, two knees, two hands, chest, and chin. Benefits: Strengthens arms and chest muscles, improves flexibility of spine, develops chest and respiratory capacity, prepares the body for deeper backbends. This pose is a prostration that cultivates humility and surrender. It's an integral part of Surya Namaskar (Sun Salutation) and builds upper body strength.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_011",
    "title": "Cobra Pose (Bhujangasana)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "27-28",
    "info": "Lie on the stomach with legs extended back, tops of feet on the floor. Place hands under shoulders, elbows close to body. Press through hands and slowly lift chest off the floor. Keep elbows slightly bent and shoulders away from ears. Look upward gently. Benefits: Strengthens spine and back muscles, opens chest and improves breathing, stimulates abdominal organs and improves digestion, relieves stress and fatigue, helps relieve symptoms of asthma. Those with herniated discs should practice with caution or avoid.",
    "precautions": "Contraindications: Avoid if pregnant, have serious back injury, carpal tunnel syndrome, or recent abdominal surgery. Avoid if pregnant, have serious back injury, carpal tunnel syndrome, or recent abdominal surgery."
  },
  {
    "id": "yoga_012",
    "title": "Child's Pose (Balasana)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "29-30",
    "info": "Kneel on the floor with knees hip-width apart and sit back on the heels. Exhale and lower the torso between the thighs. Extend arms forward on the floor or rest them alongside the body. Rest forehead on the ground. Breathe naturally and relax. Benefits: Gently stretches hips, thighs, and ankles, calms the brain and relieves stress and fatigue, relieves back and neck pain when done with head supported, helps alleviate menstrual discomfort. This is a resting pose that can be practiced between more challenging postures. It creates a sense of security and comfort, helping to release tension.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_013",
    "title": "Tree Pose (Vrikshasana)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "31-32",
    "info": "Stand with feet together. Shift weight to left foot and place right foot on inner left thigh, calf, or ankle (never on knee). Bring hands to prayer position at chest or raise arms overhead. Focus on a fixed point for balance. Hold for several breaths, then repeat on the other side. Benefits: Improves balance and concentration, strengthens legs, ankles, and feet, stretches hips and inner thighs, improves posture and body awareness, builds confidence. Regular practice helps develop steadiness of body and mind. It's excellent for improving focus and mental clarity.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_014",
    "title": "Triangle Pose (Trikonasana)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "33-34",
    "info": "Stand with feet wide apart. Turn right foot out 90 degrees and left foot slightly inward. Extend arms to sides at shoulder height. Exhale and reach right hand toward right foot, placing it on shin, ankle, or floor. Extend left arm upward, looking at left hand. Benefits: Stretches legs, hips, spine, and shoulders, strengthens thighs, knees, and ankles, stimulates abdominal organs and improves digestion, relieves back pain and stress, improves sense of balance. Those with neck problems should not look upward.",
    "precautions": "Contraindications: Avoid if you have low blood pressure, headache, or diarrhea. Avoid if you have low blood pressure, headache, or diarrhea."
  },
  {
    "id": "yoga_015",
    "title": "Warrior Pose I (Virabhadrasana I)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "35-36",
    "info": "Stand with feet wide apart. Turn right foot out 90 degrees, turn left foot in slightly. Rotate torso to face right. Bend right knee over right ankle, forming 90 degree angle. Raise arms overhead, palms facing each other or touching. Look upward. Benefits: Strengthens legs, opens hips and chest, stretches arms and shoulders, improves focus and stability, builds stamina and endurance, energizes the entire body. This pose embodies the qualities of a spiritual warrior: strength, focus, and determination. It's excellent for building confidence and willpower.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_016",
    "title": "Seated Forward Bend (Paschimottanasana)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "37-38",
    "info": "Sit with legs extended forward, feet together. Inhale and raise arms overhead, lengthening spine. Exhale and hinge from hips, reaching forward to hold feet, ankles, or shins. Keep spine long, avoid rounding back. Relax into the stretch with each breath. Benefits: Stretches spine, shoulders, and hamstrings, stimulates liver, kidneys, and digestive organs, calms the mind and relieves stress, improves digestion and reduces fatigue, therapeutic for high blood pressure and insomnia. Pregnant women should avoid deep forward bends or practice with legs apart.",
    "precautions": "Contraindications: Avoid if you have asthma, diarrhea, or back injury. Avoid if you have asthma, diarrhea, or back injury."
  },
  {
    "id": "yoga_017",
    "title": "Corpse Pose (Shavasana)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "39-40",
    "info": "Lie on back with legs slightly apart, feet falling naturally to sides. Arms rest at sides, palms facing up, slightly away from body. Close eyes and breathe naturally. Release all muscular tension, starting from feet and moving upward through the body. Remain still and aware for 5-10 minutes. Benefits: Deeply relaxes entire body and mind, reduces blood pressure and anxiety, relieves stress and mild depression, helps insomnia and fatigue, improves concentration and mental clarity. This is considered one of the most important poses. It allows the body to integrate the benefits of practice and promotes deep rest and rejuvenation.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_018",
    "title": "Alternate Nostril Breathing (Nadi Shodhana Pranayama)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "41-42",
    "info": "Sit comfortably with spine straight. Using right hand, close right nostril with thumb. Inhale through left nostril. Close left nostril with ring finger, release thumb and exhale through right nostril. Inhale through right nostril. Close right nostril and exhale through left. This completes one round. Continue for 5-10 rounds. Benefits: Balances left and right hemispheres of brain, calms nervous system and reduces stress, improves respiratory function, purifies nadis (energy channels), enhances mental clarity and focus, prepares mind for meditation. This practice is excellent for anxiety and helps create mental equilibrium.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_019",
    "title": "Skull Shining Breath (Kapalabhati Pranayama)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "43-44",
    "info": "Sit comfortably with spine erect. Take a deep breath in. Exhale forcefully through nose by contracting abdominal muscles. Allow inhalation to happen passively. Continue rapid, forceful exhalations with passive inhalations. Start with 20 breaths per round, gradually increasing. Practice 3 rounds with rest between. Benefits: Cleanses respiratory system and sinuses, strengthens abdominal muscles, energizes body and mind, improves digestion, increases oxygen supply to brain, enhances concentration.",
    "precautions": "Contraindications: Avoid if pregnant, have high blood pressure, heart disease, hernia, ulcer, or during menstruation. Avoid if pregnant, have high blood pressure, heart disease, hernia, ulcer, or during menstruation."
  },
  {
    "id": "yoga_020",
    "title": "Victorious Breath (Ujjayi Pranayama)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "45-46",
    "info": "Sit comfortably with spine straight. Slightly contract the back of throat to create gentle resistance to airflow. Breathe slowly and deeply through nose, creating soft oceanic sound. The breath should be audible to you but not to others. Maintain even, smooth rhythm. Benefits: Calms nervous system and focuses the mind, increases oxygenation and builds internal heat, improves concentration and relieves tension, helps regulate blood pressure, supports thyroid function. This breath is often used during asana practice to maintain internal focus. It helps practitioners stay present and creates a meditative quality in practice.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_021",
    "title": "Bee Breath (Bhramari Pranayama)",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "47-48",
    "info": "Sit comfortably with eyes closed. Place index fingers on ears to close them gently. Inhale deeply through nose. While exhaling, make a humming sound like a bee. Feel the vibration in the head. Repeat 5-10 times. Benefits: Instantly calms the mind, relieves stress, anxiety and anger, lowers blood pressure, improves concentration and memory, alleviates throat ailments, helps with insomnia and headaches. The vibration created during practice has a profoundly calming effect on the nervous system. This is one of the best breathing techniques for preparing the mind for meditation.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_022",
    "title": "Meditation - Introduction and Benefits",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "49-50",
    "info": "Meditation is a practice where an individual uses a technique to train attention and awareness, achieving a mentally clear and emotionally calm state. It's the culmination of yoga practice. Regular meditation helps develop witness consciousness - the ability to observe thoughts without attachment. Benefits include: Reduces stress and promotes emotional health, enhances self-awareness and lengthens attention span, may reduce age-related memory loss, generates kindness and compassion, helps control anxiety and depression, improves sleep quality. Scientific research has shown that meditation physically changes the brain, increasing gray matter in areas responsible for learning, memory, and emotional regulation.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_023",
    "title": "Meditation Posture and Preparation",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "51-52",
    "info": "Choose a comfortable seated position: Easy Pose (Sukhasana), Lotus Pose (Padmasana), or sitting on a chair with feet flat on floor. Keep spine naturally erect, not stiff. Place hands in Gyana Mudra (index finger and thumb touching) or rest them on knees. Relax shoulders and close eyes gently. Breathe naturally and settle into stillness. Guidelines: Practice in a quiet, clean space, same time and place daily, morning is ideal but evening also suitable, start with 5-10 minutes and gradually increase, consistency is more important than duration. The key to successful meditation is finding a posture that is both alert and relaxed.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_024",
    "title": "Breath Awareness Meditation",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "53-54",
    "info": "Sit in meditation posture. Close eyes and bring attention to natural breath. Observe the breath without trying to change it. Notice the sensation of breath at nostrils, chest, or abdomen. When mind wanders, gently bring attention back to breath. Continue for chosen duration. This simple yet powerful practice: Develops concentration and mindfulness, calms mental fluctuations, creates space between stimulus and response, builds foundation for deeper meditation practices. Breath awareness is accessible to beginners and profound for advanced practitioners. It anchors awareness in the present moment and develops the quality of witnessing.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_025",
    "title": "Om Meditation",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "55-56",
    "info": "Sit in meditation posture with eyes closed. Take a deep breath and chant 'Om' while exhaling, extending the sound throughout the exhalation. Feel the vibration starting from the navel (O) and moving to the throat and head (M). Chant for 5-10 minutes. Benefits: The vibration of Om harmonizes body, mind, and spirit, improves concentration and mental clarity, reduces stress and promotes inner peace, creates positive energy in the environment, connects practitioner to universal consciousness. Om is considered the primordial sound, the vibration of the universe. Regular practice of Om meditation creates profound states of peace and unity.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_026",
    "title": "General Guidelines for Safe Yoga Practice",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "57-58",
    "info": "Important guidelines for safe practice: Practice on an empty stomach, or wait 2-3 hours after a meal. Wear comfortable, loose-fitting clothing. Use a yoga mat or non-slip surface. Never force or strain; practice within your comfortable limits. Breathe smoothly; never hold breath unless instructed. Stop immediately if you feel pain, dizziness, or discomfort. Consult a qualified teacher, especially as a beginner. Be consistent; daily practice is more beneficial than occasional intense sessions. Avoid comparison with others; yoga is a personal journey. Women should avoid inversions and intense practice during menstruation. Listen to your body and honor its wisdom.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_027",
    "title": "Contraindications and When to Avoid Yoga",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "59-60",
    "info": "Certain conditions require caution or avoidance of specific practices: Pregnancy: Avoid deep twists, strong backbends, inversions, and abdominal pressure. Practice under guidance. High blood pressure: Avoid inversions, breath retention, intense backbends. Focus on gentle practice and relaxation. Heart conditions: Avoid strenuous poses, breath retention. Practice gentle yoga with medical clearance. Recent surgery or injury: Wait for complete healing. Resume gradually with professional guidance. Hernia: Avoid abdominal pressure, intense forward bends, and inversions. Glaucoma: Avoid inversions and poses where head is below heart. Severe osteoporosis: Avoid deep forward bends and twists. Always inform your instructor about health conditions and practice under qualified supervision.",
    "precautions": "Consult a healthcare provider before practicing if you have any medical conditions."
  },
  {
    "id": "yoga_028",
    "title": "Yoga for Stress Management",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "61-62",
    "info": "Yoga is highly effective for managing stress. Recommended practices include: Gentle asanas that release physical tension (Child's Pose, Legs-up-the-Wall, Seated Forward Bends). Pranayama techniques (Alternate Nostril Breathing, Ujjayi, Bhramari) that calm the nervous system. Relaxation techniques like Shavasana and Yoga Nidra. Regular meditation to develop equanimity and witness consciousness. How it works: Yoga activates the parasympathetic nervous system (rest and digest), reduces cortisol (stress hormone), increases GABA (calming neurotransmitter), improves heart rate variability, enhances body awareness and emotional regulation. Even 15-20 minutes of gentle yoga practice can significantly reduce stress levels.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_029",
    "title": "Yoga for Back Pain Relief",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "63-64",
    "info": "Yoga can be therapeutic for back pain when practiced correctly. Beneficial poses include: Cat-Cow Stretch: Mobilizes the spine and relieves tension. Child's Pose: Gently stretches lower back. Cobra Pose (gentle): Strengthens back muscles and improves flexibility. Bridge Pose: Strengthens back and core muscles. Legs-up-the-Wall: Relieves lower back pressure. Important considerations: Always practice gently and within pain-free range. Focus on strengthening core muscles to support the spine. Avoid deep forward bends if you have disc problems. Never force into poses; back pain requires patience. Consider consulting a yoga therapist for personalized guidance. Regular practice of appropriate poses can prevent recurrence of back pain.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_030",
    "title": "Yoga for Better Sleep",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "65-66",
    "info": "Yoga promotes better sleep through multiple mechanisms. Recommended evening practices: Gentle forward bends (Seated Forward Bend, Child's Pose) calm the nervous system. Legs-up-the-Wall relieves fatigue and induces relaxation. Reclining Bound Angle Pose opens hips and releases tension. Alternate Nostril Breathing balances energy. Extended Shavasana (15-20 minutes) with body scan relaxation. Tips for sleep-promoting practice: Practice 1-2 hours before bedtime. Keep lights dim and environment quiet. Avoid stimulating practices like Kapalabhati or intense backbends in evening. Focus on long, slow exhalations which activate relaxation response. Regular practice regulates circadian rhythms, reduces anxiety and mental chatter, releases physical tension, and promotes overall relaxation conducive to restful sleep.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_031",
    "title": "Yoga for Anxiety and Mental Health",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "67-68",
    "info": "Yoga is increasingly recognized as a complementary therapy for anxiety and mental health. Effective practices include: Grounding poses (Mountain Pose, Tree Pose, Warrior poses) create stability and confidence. Hip openers (Pigeon Pose, Butterfly Pose) release stored emotions. Gentle backbends (Cobra, Bridge) open the heart and counteract collapsed posture of anxiety. Cooling pranayama (Alternate Nostril Breathing, Bee Breath) calm the nervous system. Meditation and mindfulness practices develop equanimity. How yoga helps: Reduces physiological arousal and stress hormones, improves vagal tone (key for emotional regulation), enhances body awareness and interoception, provides tools for self-regulation, cultivates present-moment awareness. For clinical anxiety or depression, yoga should complement professional treatment, not replace it.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_032",
    "title": "Yoga for Digestive Health",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "69-70",
    "info": "Specific yoga practices support healthy digestion. Beneficial poses include: Twists (Seated Twist, Revolved Triangle) massage abdominal organs and stimulate peristalsis. Forward bends (Paschimottanasana, Child's Pose) compress abdomen and aid elimination. Gentle backbends (Cobra, Camel) stretch abdominal area and improve organ function. Pavanamuktasana (Wind-Relieving Pose) specifically releases gas and aids digestion. Pranayama like Kapalabhati strengthens abdominal muscles. Yoga improves digestion by: Increasing blood flow to digestive organs, reducing stress which impairs digestion, stimulating the vagus nerve which controls digestive processes, strengthening core muscles supporting organ function. Practice on empty stomach for best results. Consistent practice along with proper diet and hydration optimizes digestive health.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_033",
    "title": "Yoga for Flexibility and Strength",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "71-72",
    "info": "Yoga uniquely combines flexibility and strength development. For flexibility: Hold poses for longer duration (30 seconds to 2 minutes). Focus on hip openers, hamstring stretches, and shoulder openers. Practice consistently; flexibility improves gradually. Never bounce or force; use breath to deepen stretches safely. For strength: Build duration in weight-bearing poses (Plank, Warrior poses, Chair Pose). Practice arm balances and inversions progressively. Engage muscles actively even in stretching poses. Balance work: Yoga creates balanced strength - muscles are strong yet flexible, preventing injury common with strength training alone. Flexibility without strength can lead to instability; strength without flexibility leads to rigidity. Yoga's balanced approach creates functional fitness applicable to daily life.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_034",
    "title": "Yoga for Heart Health",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "73-74",
    "info": "Research shows yoga benefits cardiovascular health. Recommended practices: Gentle, sustained asanas improve circulation without overstraining. Forward bends calm the heart rate. Gentle inversions (Legs-up-the-Wall) improve venous return. Pranayama, especially slow breathing, enhances heart rate variability. Meditation reduces stress-related cardiovascular risk factors. Evidence-based benefits: Lowers blood pressure and resting heart rate, reduces cholesterol and triglycerides, decreases inflammation markers, aids weight management, reduces stress and anxiety that impact heart health. Important: Those with heart conditions should practice under medical supervision, avoid breath retention and strenuous poses, focus on gentle, therapeutic approaches. Yoga complements medical treatment and cardiac rehabilitation programs effectively.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_035",
    "title": "Yoga for Seniors and Elderly",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "75-76",
    "info": "Yoga is excellent for healthy aging when adapted appropriately. Modifications for seniors: Use props liberally (chairs, blocks, straps, walls) for support and stability. Practice chair yoga if floor poses are challenging. Focus on balance poses (with support) to prevent falls. Emphasize breath awareness and gentle movements. Keep transitions slow and mindful. Benefits for elderly: Improves balance, flexibility, and strength, reducing fall risk. Enhances joint health and mobility. Supports cognitive function and mental clarity. Provides social connection in group classes. Promotes independence and quality of life. Inform instructor of health conditions (osteoporosis, joint replacements, etc.). Never compete or compare; honor body's current capacity. The goal is maintaining functionality and well-being, not perfection in poses.",
    "precautions": "Precautions: Always practice under qualified instruction."
  },
  {
    "id": "yoga_036",
    "title": "Yoga and Breath - Pranayama Fundamentals",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "77-78",
    "info": "Pranayama, the fourth limb of yoga, means control of life force through breath. Breath components: Puraka (inhalation), Rechaka (exhalation), Kumbhaka (retention). Complete yogic breath involves three parts: Abdominal (diaphragmatic), Thoracic (chest), Clavicular (upper chest). Benefits of pranayama: Increases oxygen supply and energy levels, removes toxins through enhanced gas exchange, balances nervous system, prepares mind for meditation, influences emotional states directly. General guidelines: Always practice on empty stomach. Begin with natural breathing awareness before techniques. Never strain; breathing should be smooth and comfortable. Start with simple techniques, progress gradually. Discontinue if you feel dizzy or uncomfortable. Pranayama is powerful and should be learned from qualified teachers. Regular practice transforms physical, mental, and emotional well-being.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_037",
    "title": "Surya Namaskar (Sun Salutation) - Complete Sequence",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "79-80",
    "info": "Surya Namaskar is a complete practice integrating asanas, pranayama, and meditation. The 12-step sequence: 1) Prayer Pose 2) Raised Arms Pose 3) Hand to Foot Pose 4) Equestrian Pose 5) Mountain Pose 6) Eight Limbs Pose 7) Cobra Pose 8) Mountain Pose 9) Equestrian Pose (other leg) 10) Hand to Foot Pose 11) Raised Arms Pose 12) Prayer Pose. Each position is coordinated with breath - inhale for extending movements, exhale for contracting movements. Benefits: Provides complete body workout in short time, improves cardiovascular health, enhances flexibility and strength, massages internal organs, improves concentration. Practice 6-12 rounds daily, gradually increasing. Ideal for morning practice. Surya Namaskar is a prayer to the sun, the source of all life, combining physical exercise with spiritual reverence.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_038",
    "title": "Yoga Philosophy - Eight Limbs of Yoga",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "81-82",
    "info": "Patanjali's Yoga Sutras outline the eight limbs (Ashtanga) of yoga: 1) Yama (ethical restraints): Non-violence, truthfulness, non-stealing, continence, non-possessiveness. 2) Niyama (observances): Purity, contentment, discipline, self-study, surrender. 3) Asana (postures): Steady, comfortable poses for physical health. 4) Pranayama (breath control): Regulation of life force. 5) Pratyahara (sense withdrawal): Turning attention inward. 6) Dharana (concentration): Focused attention. 7) Dhyana (meditation): Sustained awareness. 8) Samadhi (absorption): Union with the object of meditation. Physical practice (asana and pranayama) is just the beginning. The deeper limbs lead to mental mastery and spiritual realization. Complete yoga encompasses all aspects - ethical living, physical health, mental discipline, and spiritual growth.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_039",
    "title": "Yoga for Women's Health",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "83-84",
    "info": "Yoga supports women's health throughout life stages. For menstruation: Gentle practice is beneficial. Avoid inversions, intense twists, and strenuous poses. Focus on restorative poses, forward bends, and relaxation. For fertility and reproductive health: Hip openers improve circulation to pelvic region. Stress-reducing practices support hormonal balance. Prenatal yoga (with qualified instruction) supports healthy pregnancy. Postpartum practice (after medical clearance) aids recovery. For menopause: Cooling practices reduce hot flashes. Restorative poses support hormonal transition. Regular practice reduces anxiety and mood swings. General benefits: Balances hormones naturally, reduces menstrual discomfort, supports pelvic floor health, provides stress relief and emotional balance. Women should work with instructors knowledgeable about women's health and yoga.",
    "precautions": "Consult a healthcare provider before practicing if you have any medical conditions."
  },
  {
    "id": "yoga_040",
    "title": "Building a Personal Yoga Practice",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "85-86",
    "info": "Developing a sustainable personal practice requires intention and planning. Steps to build your practice: Start with commitment - decide on frequency and duration you can maintain. Create sacred space - dedicate a clean, quiet area for practice. Establish routine - practice same time daily, preferably morning. Begin with fundamentals - master basic poses and breathing before advancing. Balance your practice - include warm-up, asanas, pranayama, relaxation, and meditation. Listen to your body - adjust based on energy, health, and life circumstances. Be consistent, not perfect - short daily practice beats occasional long sessions. Sample 30-minute routine: 5 min warm-up and Sun Salutations, 15 min asanas (standing, seated, twists, backbend), 5 min pranayama, 5 min meditation and Shavasana. Adapt based on your needs. Over time, your practice becomes a cherished sanctuary supporting all aspects of life.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_041",
    "title": "Yoga and Modern Science - Evidence-Based Benefits",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "87-88",
    "info": "Modern research validates ancient yoga wisdom. Scientific evidence shows: Neurological effects - Increases gray matter in hippocampus (memory and learning), strengthens prefrontal cortex (decision-making), reduces amygdala size (fear and stress response). Physiological effects - Lowers cortisol and inflammatory markers, improves immune function, enhances cardiovascular health, regulates blood sugar. Psychological effects - Reduces symptoms of anxiety and depression, improves attention and cognitive function, enhances emotional regulation and resilience. Clinical applications - Effective complementary therapy for chronic pain, PTSD, addiction recovery, cancer care support. Research institutions worldwide now study yoga's therapeutic potential. While science confirms benefits, yoga's transformative power extends beyond measurable outcomes to subjective experiences of peace, connection, and wholeness that define human flourishing.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_042",
    "title": "Yoga Nidra - Yogic Sleep and Deep Relaxation",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "89-90",
    "info": "Yoga Nidra is a systematic method of complete physical, mental, and emotional relaxation. Practice involves lying in Shavasana while following guided instructions through: Body awareness - systematically moving attention through body parts. Breath awareness - observing natural breath without manipulation. Opposite sensations - experiencing contrasts (heavy/light, hot/cold). Visualization - guided imagery for deeper relaxation. Sankalpa (resolve) - positive affirmation planted in relaxed state. Benefits: One hour of Yoga Nidra equals 4 hours of regular sleep in restorative value. Reduces stress, anxiety, and insomnia. Accesses subconscious mind for transformation. Enhances creativity and problem-solving. Supports healing and recovery. Regular practice creates profound rest while maintaining awareness. It's accessible to everyone, including those who can't practice asanas. Yoga Nidra guides practitioners to the threshold between waking and sleeping, accessing deep healing states.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_043",
    "title": "Yoga for Children and Teens",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "91-92",
    "info": "Yoga benefits children's development holistically. Age-appropriate adaptations: Keep sessions shorter (20-30 minutes for children). Make it playful and creative - use stories, games, and imaginative themes. Allow movement and self-expression. Focus on fun, not perfection. Include partner and group activities. Benefits for children: Improves physical fitness, coordination, and body awareness. Enhances concentration and academic performance. Builds self-esteem and emotional regulation. Provides healthy stress management tools. Improves social skills and cooperation. For teens: Addresses anxiety, body image issues, and social pressure. Provides healthy coping mechanisms. Supports identity development and self-awareness. Schools increasingly include yoga in curricula, recognizing its value for holistic education. Early exposure to yoga equips young people with lifelong wellness tools.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_044",
    "title": "Yoga and Nutrition - Holistic Wellness",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "93-94",
    "info": "Yoga philosophy extends to dietary practices supporting optimal health. Yogic diet principles: Sattvic (pure) foods - Fresh fruits, vegetables, whole grains, nuts, seeds, dairy. These promote clarity, lightness, and vitality. Minimize Rajasic (stimulating) foods - Spicy, salty, sour foods that excite senses and mind. Avoid Tamasic (dulling) foods - Processed, stale, overeated, preserved foods that create lethargy. Additional guidelines: Eat mindfully and with gratitude. Consume appropriate quantity - neither too much nor too little. Choose seasonal and locally grown foods when possible. Stay well hydrated. Avoid eating when upset or rushed. Practice eating in peaceful environment. Yoga is about ahimsa (non-violence), which many practitioners extend to vegetarian or vegan diet, though this is personal choice. The key is conscious eating that supports your practice and well-being. Good nutrition and yoga are synergistic for optimal health.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_045",
    "title": "Common Yoga Mistakes and How to Avoid Them",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "95-96",
    "info": "Common mistakes that limit progress or cause injury: Comparing with others - Yoga is personal practice; honor your unique body and journey. Holding breath - Breath should flow smoothly; breath-holding creates tension. Skipping warm-up - Cold muscles are prone to injury; always warm up properly. Forcing into poses - Never force; use props and modifications as needed. Ignoring pain signals - Distinguish between comfortable stretch and harmful pain. Skipping Shavasana - Final relaxation is essential for integration and restoration. Inconsistent practice - Regular practice is more effective than occasional intense sessions. Neglecting breath and meditation - Physical practice alone misses yoga's deeper benefits. Practicing only strength or flexibility - Balance both for optimal results. Not seeking guidance - Qualified instruction ensures safe, effective practice. Awareness of these pitfalls helps practitioners develop safe, sustainable, and transformative yoga practice.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_046",
    "title": "Yoga Mudras - Hand Gestures for Energy and Healing",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "97-98",
    "info": "Mudras are symbolic hand gestures used in yoga and meditation to direct energy flow. Common mudras: Gyana Mudra (Wisdom) - Thumb and index finger touching, other fingers extended. Enhances concentration and wisdom. Anjali Mudra (Prayer) - Palms pressed together at heart. Represents gratitude and respect, balances left-right brain hemispheres. Chin Mudra (Consciousness) - Similar to Gyana but palms facing up. Promotes receptivity and inner awareness. Dhyana Mudra (Meditation) - Hands resting in lap, right on left, thumbs touching. Traditional meditation mudra creating closed energy circuit. Prana Mudra (Life Force) - Thumb, ring and little fingers touching. Energizes and revitalizes. How mudras work: According to yogic science, fingers represent five elements and energy channels. Specific finger positions influence energy flow and consciousness. Modern perspective: Hand positions may influence nervous system through hand-brain neural connections. Practice mudras during pranayama and meditation to enhance their effects.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_047",
    "title": "Yoga for Immune System Support",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "99-100",
    "info": "Yoga strengthens immune function through multiple pathways. Beneficial practices: Gentle inversions (Legs-up-the-Wall, Shoulder Stand) promote lymphatic drainage. Twists massage lymphoid organs (spleen, thymus) supporting immunity. Pranayama (Kapalabhati, Bhastrika) removes toxins and energizes. Meditation reduces stress hormones that suppress immunity. Adequate rest in Shavasana allows immune system recovery. Mechanisms: Reduces chronic inflammation, Decreases stress hormones (cortisol) that impair immune function, Improves lymphatic circulation, Enhances natural killer cell activity, Supports better sleep (crucial for immunity), Promotes overall vitality and resilience. Lifestyle factors: Regular practice is more effective than occasional intense sessions. Combine with adequate sleep, good nutrition, and stress management. Yoga doesn't replace medical care but supports body's natural defense systems. During illness, practice gentle restorative yoga; resume vigorous practice after recovery. Building immunity is gradual process requiring consistent, holistic approach.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_048",
    "title": "Yoga Therapy - Personalized Approach to Health",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "101-102",
    "info": "Yoga therapy applies yoga practices therapeutically for specific health conditions. How it differs from regular classes: One-on-one or small group format, Personalized assessment of individual needs, Customized practice addressing specific conditions, Integration with medical treatment, Gradual, progressive approach, Emphasis on self-empowerment and home practice. Conditions addressed: Chronic pain (back pain, arthritis, fibromyalgia), Mental health (anxiety, depression, PTSD), Cardiovascular disease, Respiratory conditions (asthma, COPD), Neurological conditions, Cancer care support, Digestive disorders, Sleep disorders. Yoga therapist approach: Considers whole person - physical, mental, emotional, spiritual. Uses assessment tools to understand individual constitution and imbalances. Prescribes specific practices (asanas, pranayama, meditation, lifestyle). Monitors progress and adjusts approach. Collaborates with healthcare team. If you have health concerns, seek certified yoga therapist (C-IAYT) rather than general yoga classes. Therapeutic approach ensures safety and optimal results.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_049",
    "title": "Creating a Balanced Yoga Sequence",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "103-104",
    "info": "Well-structured sequence maximizes benefits and prevents injury. Sequence principles: 1) Warm-up (5-10 min): Gentle movements, joint rotations, easy flows to prepare body. 2) Standing poses (10-15 min): Build heat, strength, and focus. Include balances. 3) Seated poses and forward bends (5-10 min): Cool energy, stretch hamstrings and back. 4) Twists (3-5 min): Detoxify, massage organs, neutralize spine. 5) Backbends (5-8 min): Open heart, energize, counteract forward bending. 6) Inversions (optional, 3-5 min): Shift perspective, improve circulation. 7) Counter poses: Follow each intense pose with neutralizing pose. 8) Cool-down (3-5 min): Gentle stretches, hip openers. 9) Pranayama (5-10 min): Breathing practices. 10) Meditation (5-10 min): Stillness and awareness. 11) Shavasana (5-10 min): Essential final relaxation. Additional principles: Move spine in all directions. Balance strengthening and stretching. Progress from simple to complex. Coordinate breath with movement. Adapt based on time, energy, and goals.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_050",
    "title": "Yoga as a Lifelong Journey",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "105-106",
    "info": "Yoga is not a destination but a continuous journey of self-discovery and growth. The practice evolves throughout life: Beginners focus on learning poses and building physical capacity. Intermediate practitioners deepen understanding of breath, alignment, and energy. Advanced practitioners explore subtle practices and meditative states. All stages are equally valid; yoga meets you where you are. Beyond physical practice: Initially drawn to physical benefits, practitioners often discover deeper dimensions - mental clarity, emotional balance, spiritual connection. Yoga philosophy and ethics naturally integrate into daily life. The mat becomes laboratory for life - learning patience, non-judgment, presence. Obstacles as teachers: Plateaus, injuries, and challenges are part of the journey. They teach acceptance, adaptation, and listening to body's wisdom. Community and tradition: Learning from teachers, practicing with others, studying texts connects us to ancient lineage. The ultimate goal: Not perfect poses but self-realization - knowing your true nature beyond body and mind. Yoga offers tools for navigating life with grace, wisdom, and compassion. The practice continues as long as we breathe.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_051",
    "title": "Tadasana - Mountain Pose Fundamentals",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "20-21",
    "info": "Tadasana or Mountain Pose is the foundation of all standing poses. Stand with feet together or hip-width apart, weight evenly distributed across all four corners of each foot. Engage thigh muscles, lift kneecaps, tuck tailbone slightly. Lengthen spine upward, roll shoulders back and down. Arms rest alongside body with palms facing forward or joined in prayer at heart. Gaze forward with neck long. Benefits: Improves posture and body awareness, strengthens thighs, knees, and ankles, firms abdomen and buttocks, relieves sciatica, reduces flat feet. This pose teaches proper alignment that carries into all other poses. It develops stillness, stability, and groundedness. Regular practice corrects postural imbalances from prolonged sitting. Though it appears simple, Tadasana requires full-body awareness and engagement.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_052",
    "title": "Vrikshasana - Tree Pose Detailed Instructions",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "22-23",
    "info": "Vrikshasana improves balance and concentration. Begin in Tadasana. Shift weight to left foot, pressing it firmly into floor. Bend right knee and place right foot on inner left thigh, calf, or ankle - never directly on the knee joint. Flex right foot so toes point toward floor. Bring hands to prayer position at heart center or raise arms overhead like branches. Find a focal point (drishti) to maintain balance. Hold for 5-10 breaths. Release and repeat on opposite side. Benefits: Strengthens legs, ankles, and feet, opens hips and groin, improves balance and proprioception, enhances concentration and mental clarity, builds confidence and poise. Modifications: Practice near a wall for support, keep hands at heart if raising arms is challenging, place foot lower if hip flexibility is limited. Regular practice develops both physical and mental steadiness.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_053",
    "title": "Trikonasana - Triangle Pose Complete Guide",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "24-26",
    "info": "Trikonasana is a fundamental standing pose with extensive benefits. Stand with feet 3-4 feet apart. Turn right foot out 90 degrees, left foot in 15 degrees. Align right heel with left arch. Extend arms parallel to floor at shoulder height, palms down. Inhale and lengthen spine. Exhale and reach right hand toward right foot, hinging at hip. Place right hand on shin, ankle, floor, or use block. Extend left arm toward ceiling, rotating torso open. Look up at left hand or forward if neck is sensitive. Hold 5-10 breaths. Benefits: Stretches legs, groins, hips, shoulders, chest, and spine, strengthens thighs, knees, and ankles, stimulates abdominal organs improving digestion, relieves stress and anxiety, therapeutic for flat feet, infertility, neck pain, osteoporosis, and sciatica. Those with high blood pressure should not look upward. Neck problems require keeping gaze forward or down.",
    "precautions": "Contraindications: Avoid with low blood pressure, diarrhea, headache."
  },
  {
    "id": "yoga_054",
    "title": "Virabhadrasana I - Warrior I Comprehensive",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "27-28",
    "info": "Warrior I embodies the spiritual warrior's strength and determination. From Tadasana, step feet 4-5 feet apart. Turn right foot out 90 degrees and left foot in 45-60 degrees. Rotate hips and torso to face over right leg. Square hips to front as much as possible. Bend right knee over ankle, creating 90-degree angle. Keep left leg strong and straight. Raise arms overhead, palms facing or touching. Draw shoulder blades down back. Lift chest and gaze upward. Hold 5-10 breaths. Benefits: Strengthens shoulders, arms, legs, ankles, and back, opens chest, lungs, and hips, improves focus, balance, and stability, stretches hip flexors, thighs, ankles, builds stamina, courage, and concentration. Named after fierce warrior Virabhadra from Hindu mythology. This pose develops inner and outer strength, teaching us to stand firm in life's challenges while remaining open-hearted.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_055",
    "title": "Virabhadrasana II - Warrior II Full Practice",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "29-30",
    "info": "Warrior II cultivates strength and groundedness. Stand with feet 4-5 feet apart. Turn right foot out 90 degrees, left foot in slightly. Align right heel with left arch. Extend arms parallel to floor, palms down. Bend right knee directly over ankle, thigh parallel to floor. Keep left leg straight and strong. Turn head to gaze over right hand. Press outer edge of left foot firmly down. Hold 5-10 breaths. Benefits: Strengthens and stretches legs, ankles, and arms, opens hips, chest, and shoulders, improves concentration and stability, stimulates abdominal organs, increases stamina, relieves backache especially in second trimester of pregnancy (with medical guidance). Energetically, this pose teaches us to simultaneously focus forward while remaining aware of what's behind us - living fully in the present while honoring the past. The wide stance creates stability and power, while the open arms represent embracing life's experiences.",
    "precautions": "Consult a healthcare provider before practicing if you have any medical conditions."
  },
  {
    "id": "yoga_056",
    "title": "Uttanasana - Standing Forward Bend Detailed",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "31-32",
    "info": "Uttanasana is a calming forward fold with numerous benefits. From Tadasana, exhale and fold forward from hip joints, not waist. Keep legs relatively straight without locking knees. Bring fingertips or palms to floor beside feet, or hold opposite elbows. Let head hang heavy. With each inhalation, lift and lengthen torso slightly. With each exhalation, release deeper into fold. Hold 30 seconds to 1 minute. To come up, place hands on hips, lengthen front torso, and rise on inhalation. Benefits: Calms brain and relieves stress and mild depression, stimulates liver and kidneys, stretches hamstrings, calves, and hips, strengthens thighs and knees, improves digestion, relieves headache and insomnia, therapeutic for asthma, high blood pressure, infertility, osteoporosis, and sinusitis. Those with hamstring injuries should keep knees bent. Forward folds are introspective, turning attention inward, promoting surrender and letting go.",
    "precautions": "Contraindications: Back injury - do with bent knees or avoid."
  },
  {
    "id": "yoga_057",
    "title": "Adho Mukha Svanasana - Downward Facing Dog Complete",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "33-35",
    "info": "Downward Facing Dog is one of yoga's most recognizable poses. Start on hands and knees. Place hands shoulder-width apart, fingers spread wide. Tuck toes under and lift hips up and back, straightening legs. Press hands firmly into mat, especially through index fingers and thumbs. Rotate upper arms outward while rotating inner thighs inward. Engage quadriceps to take weight off arms. Work heels toward floor - they don't need to touch. Let head hang between upper arms, ears aligned with upper arms. Gaze toward navel. Hold 1-3 minutes. Benefits: Energizes and rejuvenates entire body, deeply stretches hamstrings, calves, arches, hands, strengthens arms, legs, and torso, relieves back pain, headaches, insomnia, and fatigue, therapeutic for high blood pressure, asthma, flat feet, sciatica, and sinusitis, builds bone density in arms and legs. This is simultaneously an active pose building strength and a restorative pose when held longer.",
    "precautions": "Contraindications: Carpal tunnel syndrome, late-term pregnancy, high blood pressure or headache (support head)."
  },
  {
    "id": "yoga_058",
    "title": "Bhujangasana - Cobra Pose In-Depth",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "36-37",
    "info": "Bhujangasana strengthens the spine and opens the heart. Lie prone with legs extended, tops of feet on floor. Place palms on floor beside ribs, elbows close to body. Hug elbows to sides. Press pubic bone into floor. Inhale and slowly lift chest off floor using back strength, not pushing heavily into hands. Draw shoulders back and down. Lift through top of sternum but avoid jutting chin forward. Keep neck in neutral position. Hold 15-30 seconds, breathing easily. Release on exhalation. Benefits: Strengthens spine, buttocks, and backs of arms and legs, stretches chest, lungs, shoulders, and abdomen, firms buttocks, stimulates abdominal organs, opens heart and lungs, relieves stress and fatigue, therapeutic for asthma, helps relieve symptoms of sciatica and slipped disc. The cobra represents awakening of kundalini energy and transformation. This pose counteracts hours spent hunching forward, opening the heart space and improving breathing capacity.",
    "precautions": "Contraindications: Back injury, carpal tunnel, headache, pregnancy."
  },
  {
    "id": "yoga_059",
    "title": "Setu Bandhasana - Bridge Pose Full Guide",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "38-39",
    "info": "Setu Bandhasana builds strength while opening the heart. Lie on back with knees bent, feet hip-width apart, heels close to sitting bones. Press feet and arms firmly into floor. Exhale and lift hips toward ceiling. Keep thighs and feet parallel. Clasp hands under body and press arms down to lift hips higher. Lengthen tailbone toward backs of knees. Lift chin slightly away from sternum while broadening shoulder blades. Hold 30 seconds to 1 minute. Release on exhalation. Benefits: Stretches chest, neck, spine, and hip flexors, strengthens back, buttocks, legs, and ankles, improves digestion, stimulates abdominal organs, thyroid, and lungs, calms brain and reduces anxiety, stress, and mild depression, therapeutic for asthma, high blood pressure, osteoporosis, and sinusitis, relieves backache and menstrual discomfort. This pose creates a bridge between earthly and spiritual realms, connecting lower and upper body energies.",
    "precautions": "Contraindications: Neck injury - avoid or practice under guidance."
  },
  {
    "id": "yoga_060",
    "title": "Balasana - Child's Pose Complete Instructions",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "40-41",
    "info": "Balasana is a gentle resting pose that can be practiced anytime. Kneel on floor with big toes touching and knees hip-width apart (or wider for pregnancy). Exhale and lay torso between thighs. Broaden sacrum across back of pelvis. Lengthen tailbone away from back of pelvis while lifting base of skull away from back of neck. Extend arms forward, palms down, or rest them alongside body, palms up. Release forehead to floor or rest on block. Stay anywhere from 30 seconds to several minutes. Benefits: Gently stretches hips, thighs, and ankles, calms brain and relieves stress and fatigue, relieves back and neck pain when head is supported, massages and tones internal organs, lengthens and stretches spine, relieves menstrual discomfort. This pose mimics the fetal position, creating feelings of safety and comfort. It's excellent for calming anxiety and turning attention inward. Can be practiced between more challenging poses or as part of restorative sequence.",
    "precautions": "Consult a healthcare provider before practicing if you have any medical conditions."
  },
  {
    "id": "yoga_061",
    "title": "Shavasana - Corpse Pose Detailed Practice",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "42-44",
    "info": "Shavasana is the final relaxation pose, considered one of the most important in yoga. Lie on back with legs extended, feet falling naturally to sides. Arms rest alongside body, palms facing up, about 15 degrees away from torso. Adjust body so spine is aligned and symmetrical. Let feet flop open. Close eyes gently. Soften facial muscles, especially around eyes, jaw, and forehead. Breathe naturally without controlling breath. Consciously relax each body part: feet, legs, hips, abdomen, chest, hands, arms, shoulders, neck, face, and head. Release into floor's support. Let go of all effort and 'doing.' Remain for 5-15 minutes. To exit, deepen breath, gently wiggle fingers and toes, stretch arms overhead, roll to right side, and slowly sit up. Benefits: Reduces blood pressure, heart rate, and respiratory rate, activates parasympathetic nervous system, deeply relaxes muscles and releases tension, reduces anxiety, stress, headaches, and fatigue, improves concentration and mental clarity, promotes quality sleep, allows integration of practice benefits. Despite appearing simple, Shavasana is challenging because of the mind's resistance to complete stillness. It teaches the art of conscious relaxation.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_062",
    "title": "Paschimottanasana - Seated Forward Bend Complete",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "45-46",
    "info": "Paschimottanasana stretches the entire back body. Sit with legs extended forward, feet flexed. Sit on blanket if needed to tilt pelvis forward. Inhale and raise arms overhead, lengthening spine. Exhale and hinge from hips, leading with chest, not head. Keep spine long rather than rounding forward. Hold outer edges of feet, ankles, or use strap around feet. With each inhale, lengthen front torso. With each exhale, release deeper into fold. Let head and neck relax. Hold 1-3 minutes. Benefits: Calms brain and relieves stress and mild depression, stretches spine, shoulders, and hamstrings, stimulates liver, kidneys, ovaries, and uterus, improves digestion, relieves menstrual discomfort and menopause symptoms, soothes headache and anxiety, therapeutic for high blood pressure, infertility, insomnia, and sinusitis, strengthens spine during pregnancy (early term). Forward folds are introspective and calming, perfect for evening practice. Paschimottanasana literally means 'intense stretch of the west' - the back body being the western side.",
    "precautions": "Contraindications: Asthma, diarrhea, back injury."
  },
  {
    "id": "yoga_063",
    "title": "Ardha Matsyendrasana - Seated Spinal Twist",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "47-48",
    "info": "Spinal twists detoxify and energize. Sit with legs extended. Bend right knee and place right foot outside left thigh. Bend left knee and tuck left foot beside right hip (or keep left leg extended for simpler version). Sit tall, lengthening spine. Place right hand behind you on floor. Wrap left arm around right knee or place left elbow outside right knee. Inhale to lengthen spine. Exhale to twist right, looking over right shoulder. Hold 30 seconds to 1 minute. Release and repeat on opposite side. Benefits: Stretches shoulders, hips, and neck, energizes spine, stimulates digestive fire and aids elimination, massages abdominal organs including liver, kidneys, and intestines, relieves menstrual discomfort, backache, and sciatica, therapeutic for asthma and infertility, improves posture and spinal flexibility. Twists wring out the spine like a wet towel, releasing toxins and improving circulation to spinal discs. Always twist from the belly, not shoulders, and keep spine long.",
    "precautions": "Contraindications: Back or spine injury."
  },
  {
    "id": "yoga_064",
    "title": "Viparita Karani - Legs-Up-The-Wall Pose",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "49-50",
    "info": "Viparita Karani is a gentle inversion with profound benefits. Sit sideways against wall with right hip touching it. Swing legs up wall as you lower shoulders and head to floor. Buttocks can touch wall or be slightly away. Arms rest by sides or overhead. Legs can be straight or bent slightly. Stay 5-15 minutes. To exit, bend knees, roll to side, and pause before sitting up. Benefits: Regulates blood pressure, relieves tired or cramped legs and feet, gently stretches hamstrings and back of neck, relieves mild backache, calms anxiety and soothes nervous system, helps relieve symptoms of mild depression, improves problems of digestion, restores tired legs and feet, relieves menstrual cramps (avoid during menstruation for some), improves venous drainage, therapeutic for headaches, insomnia, and varicose veins. This is a restorative pose perfect for evening practice. The gentle inversion reverses blood flow without strain, refreshing legs while calming the mind. Can use bolster under hips for supported version.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_065",
    "title": "Sukhasana - Easy Pose and Meditation Posture",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "51-52",
    "info": "Sukhasana is a comfortable seated position for pranayama and meditation. Sit with legs crossed, right shin in front of left (alternate this in subsequent practices). Sit on blanket or cushion to elevate hips above knees. Align head, neck, and spine vertically. Rest hands on knees in Gyana Mudra (index finger and thumb touching) or palms down. Relax shoulders down and back. Lengthen spine upward. Soften belly. Gaze gently downward or close eyes. Breathe naturally. Benefits: Opens hips, strengthens back, improves posture, stretches knees and ankles (gently), calms mind, promotes sense of peace and tranquility, develops mental discipline and concentration, therapeutic for stress and anxiety. If hips are tight, sit on higher support or practice other seated positions like chair sitting. The key is finding a position that's both stable (sthira) and comfortable (sukha). Regular practice gradually opens hips and lengthens spine, making extended meditation comfortable. Sukha means 'ease' - this pose should feel easeful, not strained.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_066",
    "title": "Padmasana - Lotus Pose Proper Technique",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "53-54",
    "info": "Padmasana is the classic meditation pose requiring significant hip flexibility. Sit with legs extended. Bend right knee and cradle right shin in arms. Gently place right foot on top of left thigh, heel close to abdomen, sole facing up. Bend left knee and carefully place left foot on right thigh, bringing heels close to abdomen. Press knees toward floor (don't force). Sit tall with spine erect. Rest hands on knees in mudra or palms down. Close eyes and breathe. Benefits: Opens hips deeply, stretches ankles and knees, strengthens back and improves posture, calms brain and increases awareness, stimulates pelvis, abdomen, and bladder, facilitates easier breathing and concentration during meditation, traditionally said to awaken kundalini energy. Never force into this pose. Many practitioners require months or years to safely achieve full lotus. Practice preparatory hip openers first. Half lotus (one foot on thigh, one under opposite thigh) is a good intermediate step. The lotus flower grows from mud through water to bloom above - symbolizing spiritual evolution from earthly to enlightened consciousness.",
    "precautions": "Contraindications: Ankle or knee injury."
  },
  {
    "id": "yoga_067",
    "title": "Nadi Shodhana - Alternate Nostril Breathing Complete",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "55-57",
    "info": "Nadi Shodhana purifies energy channels and balances mind. Sit comfortably with spine erect. Rest left hand on left knee. Bring right hand to face. Fold index and middle fingers toward palm (Vishnu Mudra) or rest them on forehead between eyebrows. Use thumb to close right nostril and ring finger to close left nostril. Close right nostril with thumb. Exhale completely through left nostril. Inhale slowly and deeply through left nostril. At top of inhalation, close left nostril with ring finger. Open and exhale through right nostril. Inhale through right nostril. Close right nostril and exhale through left. This completes one round. Continue for 5-10 minutes, maintaining slow, deep, smooth breath. Benefits: Balances left and right hemispheres of brain, clears energy channels (nadis), reduces stress and anxiety, calms and focuses mind, improves respiratory function and lung capacity, lowers heart rate and blood pressure, enhances mental clarity and decision-making, prepares mind for meditation, balances sympathetic and parasympathetic nervous systems. Excellent practice before bed for better sleep or before meditation. Never force breath - it should be smooth and comfortable.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_068",
    "title": "Kapalabhati - Skull Shining Breath Detailed",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "58-59",
    "info": "Kapalabhati is a powerful cleansing breath. Sit comfortably with spine erect, hands on knees. Take a deep inhalation. Begin forceful, rapid exhalations by contracting lower belly, pushing air out through nose. Allow inhalation to happen passively - belly naturally expands. Focus on active, forceful exhalation. Start with 30 breaths per round at moderate pace. Rest with few normal breaths between rounds. Practice 3 rounds. Gradually increase to 60-120 breaths per round as you develop capacity. Benefits: Cleanses lungs and entire respiratory system, clears nasal passages and sinuses, strengthens abdominal muscles and diaphragm, improves digestion and stimulates digestive fire, energizes entire body and mind, increases oxygen supply to brain, improves concentration and memory, removes toxins and carbon dioxide, massages internal organs. Stop if you feel dizzy. This is a heating, energizing practice - best in morning. Kapalabhati means 'skull shining' - referring to the clarity and radiance it brings.",
    "precautions": "Contraindications: Pregnancy, menstruation, high blood pressure, heart disease, hernia, gastric ulcer, epilepsy, vertigo, recent abdominal surgery."
  },
  {
    "id": "yoga_069",
    "title": "Ujjayi Pranayama - Victorious Breath Complete Guide",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "60-61",
    "info": "Ujjayi breath creates internal focus and heat. Sit comfortably or practice during asanas. Slightly contract back of throat (glottis) as if fogging a mirror. Breathe in and out through nose with this throat constriction. This creates soft, oceanic sound - like ocean waves or Darth Vader. Sound should be audible to you but not people across room. Maintain steady, even rhythm. Each inhalation and exhalation should be same length - start with 4-6 seconds each. Practice for 5-20 minutes. Benefits: Builds internal heat and energy, calms nervous system while maintaining alertness, improves concentration and mental focus, enhances breath awareness, slows breath naturally extending each cycle, improves oxygenation, regulates blood pressure, supports thyroid function through throat stimulation, creates meditative quality in asana practice. This breath is often used throughout asana practice, creating moving meditation. The name means 'victorious' - victory over mind and senses. Regular practice develops powerful breath control and inner stillness. Can be practiced lying in Shavasana for deep relaxation.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_070",
    "title": "Bhramari - Bee Breath Complete Instructions",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "62-63",
    "info": "Bhramari instantly calms the mind through sound vibration. Sit comfortably with spine erect. Close eyes and soften face. Close ears with thumbs, place index fingers above eyebrows, remaining fingers over eyes (Shanmukhi Mudra), or simply close ears with index fingers. Take a deep breath in through nose. While exhaling, make a smooth, steady humming sound like a bee. Feel vibration in head and face. Keep mouth closed, teeth slightly apart. Focus on sound and vibration. Complete 5-10 rounds. Sit quietly afterward, observing effects. Benefits: Immediately calms and quiets mind, relieves stress, anxiety, anger, and frustration, reduces blood pressure, alleviates tension and headaches, improves concentration and memory, soothes nerves and reduces agitation, helps with insomnia and sleep quality, therapeutic for thyroid issues, clears throat, good for pregnant women (without breath retention), prepares mind perfectly for meditation. The vibration stimulates the pineal and pituitary glands, affecting hormone regulation. This is one of the best pranayamas for releasing mental and emotional tension. Bhramari means 'bee' - named for the buzzing sound produced.",
    "precautions": "Consult a healthcare provider before practicing if you have any medical conditions."
  },
  {
    "id": "yoga_071",
    "title": "Preparation Guidelines - Before Yoga Practice",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "General Guidelines",
    "info": "Proper preparation is essential for safe and effective yoga practice. Shauca (Cleanliness): Ensure cleanliness of surroundings, body, and mind as a prerequisite. Create a calm and quiet atmosphere with a relaxed body and mind. Empty Stomach: Practice on an empty or light stomach. Bladder and bowels should be empty. If feeling weak, take a small amount of honey in lukewarm water. Equipment: Use a yoga mat, mattress, durrie, or folded blanket for comfort. Wear light and comfortable cotton clothes that facilitate easy movement. Important Those with chronic disease, pain, cardiac problems, pregnancy, or during menstruation must seek expert consultation before beginning practice. These guidelines ensure safety and maximize benefits from yoga practice.",
    "precautions": "contraindications: Do not practice in a state of exhaustion, illness, hurry, or acute stress."
  },
  {
    "id": "yoga_072",
    "title": "During Practice Guidelines - Proper Technique",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "General Guidelines",
    "info": "Following proper guidelines during practice ensures maximum benefits. Always begin with a prayer or invocation to relax the mind and set intention. Perform all movements slowly, in a relaxed manner, with complete awareness of body and breath. Breathing should always be through the nostrils unless specifically instructed otherwise. Never hold the breath unless specified in the practice instructions. Do not hold the body tight or jerk it during movements. Perform according to your personal capacity - yoga is not a competition. Remember that results take time and persistence is key to progress. Always conclude practice with meditation, deep silence, Sankalpa (positive resolve), or Shantipatha (peace chant). This proper structure ensures that practice is safe, effective, and holistic - addressing body, breath, and mind together.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_073",
    "title": "After Practice Guidelines and Dietary Recommendations",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "General Guidelines",
    "info": "Post-practice guidelines help integrate benefits and maintain well-being. Wait 20-30 minutes after yoga practice before taking a bath. This allows the body temperature to normalize and energy to settle. Similarly, wait 20-30 minutes before eating food. This allows the digestive system to be ready and prevents discomfort. Dietary recommendations for yogic lifestyle: A vegetarian diet is recommended as it supports the practice and promotes sattvic (pure) qualities of mind. For persons over 30 years of age, two meals a day are generally sufficient unless one is ill, weak, or engaged in heavy physical activity. These guidelines are based on yogic understanding of how body, mind, and energy work together. Following them enhances the positive effects of practice and supports overall health and well-being.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_074",
    "title": "Neck Movements - Griva Shakti Vikasaka Complete Practice",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Loosening Practices",
    "info": "Neck movements are essential loosening practices before main asanas. Starting position: Samasthiti (Alert Posture) with feet 2-3 inches apart, hands straight beside body. Stage 1 - Forward and Backward Bending: Exhale and move head forward slowly, touching chin to chest. Inhale and move head up, bending back comfortably. Repeat 2 more rounds. Stage 2 - Right and Left Bending: Exhale and bend head slowly to right, bringing ear toward shoulder without raising shoulder. Inhale and return to normal. Exhale and bend to left side. Repeat 2 more rounds. Stage 3 - Right and Left Twisting: Exhale and turn head gently to right, bringing chin in line with shoulder. Inhale and return. Exhale and turn left. Repeat 2 more rounds. Stage 4 - Neck Rotation: Exhale bringing chin to chest. Inhale and rotate head clockwise in full circular motion. Exhale while coming down. Repeat full rotation anti-clockwise. Keep shoulders relaxed and steady. Elderly persons and those with chronic cervical spondylosis should avoid. Practice gently if experiencing neck pain. Benefits: Loosens neck joints and muscles, relieves tension accumulated from poor posture and stress.",
    "precautions": "Precautions: Move only as far as possible without overstraining."
  },
  {
    "id": "yoga_075",
    "title": "Shoulder Movements - Complete Practice for Upper Body",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Loosening Practices",
    "info": "Shoulder movements prepare upper body for yoga practice. Starting position: Samasthiti. Stage 1 - Shoulder Stretch: Stand with feet together, body straight. Inhale and raise both arms sideways above head, palms facing outward. Exhale and bring arms down to sides. Repeat 2 more rounds. Stage 2 - Skandha Chakra (Shoulder Rotation): Place fingers on respective shoulders forming fists at shoulders. Rotate elbows in full circle, making the largest circle possible. Inhale while raising elbows upward. Exhale while bringing them down. Touch elbows in front of chest at the bottom of rotation. Stretch them as far back as possible when moving backward. Complete rotation then reverse direction and repeat. Benefits: Makes bones, muscles, and nerves of neck and shoulder region healthy and strong. Particularly helpful for managing cervical spondylosis and frozen shoulder conditions. Regular practice improves mobility and reduces stiffness in upper back and shoulders. This practice is especially beneficial for those who work at desks or computers for extended periods.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_076",
    "title": "Trunk Movement - Kati Shakti Vikasaka for Spinal Health",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Loosening Practices",
    "info": "Trunk movements enhance spinal flexibility and core strength. Starting position: Samasthiti with legs approximately 1 foot apart for stability. Raise both arms to shoulder level, keeping them parallel with palms facing each other. Exhale and twist the body to the left side, allowing right palm to touch the left shoulder. Inhale and come back to center position. Exhale and twist body to right side, left palm touching right shoulder. Inhale and return to center. Repeat this sequence 2 more rounds, maintaining smooth coordination of breath with movement. Benefits: Improves flexibility of the spine and waist region. Strengthens oblique muscles of the abdomen. Massages internal organs aiding digestion. Helps manage minor back stiffness. Those suffering from severe back pain, vertebral disorders, disc problems, or women during menstruation should avoid this practice. The twisting motion should come from the core, not by forcing shoulders or arms.",
    "precautions": "Precautions: Cardiac patients should proceed with care and avoid holding breath."
  },
  {
    "id": "yoga_077",
    "title": "Knee Movement Practice for Joint Strength",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Loosening Practices",
    "info": "Knee movements strengthen lower body and prepare legs for standing poses. Starting position: Samasthiti with feet together. Inhale and lift both arms forward to shoulder level, keeping palms facing down. Exhale and bend both knees to create a semi-squat position, ensuring thighs become parallel to the ground. Keep heels on the floor and back relatively straight. Inhale and straighten body, returning to standing position. Repeat the sequence 2 more rounds, maintaining awareness of knee alignment. Benefits: Strengthens knee joints and surrounding muscles. Improves flexibility in hip joints. Builds leg strength essential for standing postures. Enhances balance and stability. If experiencing knee pain, reduce the depth of the squat or skip the practice. Ensure knees track over toes and don't collapse inward. This simple movement prepares the body for more complex standing asanas and helps prevent knee injuries during practice.",
    "precautions": "Precautions: Those suffering from acute arthritis should avoid this practice."
  },
  {
    "id": "yoga_078",
    "title": "Tadasana - Palm Tree Posture Complete Instructions",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Standing Yogasanas",
    "info": "Tadasana is the foundation of all standing postures. Starting position: Samasthiti with feet approximately 2 inches apart. Inhale and lift both arms to shoulder level. Interlock the fingers and turn wrists outward so palms face away. Continue inhaling and raise arms above the head, keeping them straight. Simultaneously lift heels off the ground and balance on toes. Maintain this position for 10-30 seconds while breathing normally and keeping body steady. Exhale and slowly lower heels to ground, release hands, and bring arms down to sides. Benefits: Develops stability and firmness of body and mind. Clears spinal nerve congestion by stretching entire spine. Corrects faulty posture by strengthening postural muscles. Improves balance and body awareness. Stretches abdomen preventing sagging. Those with varicose veins or vertigo should practice without heel raise. Practice near wall for support if balance is challenging. Despite its simplicity, Tadasana teaches proper alignment and grounding essential for all yoga practices.",
    "precautions": "Precautions: Those suffering from arthritis should avoid lifting heels."
  },
  {
    "id": "yoga_079",
    "title": "Pada Hastasana - Hands to Feet Posture Detailed Guide",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Standing Yogasanas",
    "info": "Pada Hastasana is an intense forward bend with numerous benefits. Starting position: Samasthiti. Inhale and raise both arms upward, stretching the entire body from the waist. Exhale and bend forward from the hips until palms rest on the ground beside the feet. If unable to touch ground, bend only as far as comfortable. Stretch the back to make it as straight as possible in the forward fold. Hold the position for 10-30 seconds, breathing naturally. Inhale and slowly come up, raising arms overhead. Exhale and return arms to sides. Benefits: Creates a flexible and supple spine. Improves digestion by massaging abdominal organs. Helps alleviate menstrual problems in women. Stretches hamstrings and back muscles. Improves blood circulation to head and face. Those with stiff back should bend only to their capacity - touching knees or shins is acceptable. Never force the body beyond its present flexibility. Regular practice gradually increases forward bending ability.",
    "precautions": "Precautions: Avoid if suffering from cardiac disorders, vertebral or disc disorders, abdominal inflammation, hernia, peptic ulcers, glaucoma, myopia, vertigo. Avoid if suffering from cardiac disorders, vertebral or disc disorders, abdominal inflammation, hernia, peptic ulcers, glaucoma, myopia, vertigo."
  },
  {
    "id": "yoga_080",
    "title": "Ardhachakrasana - Half Wheel Posture for Back Flexibility",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Standing Yogasanas",
    "info": "Ardhachakrasana is a standing backward bend that strengthens the spine. Starting position: Samasthiti. Place both hands on the back at waist level with fingers pointing downward for support. Inhale and drop head backward gently, looking up and back. Exhale and bend backward slowly from the lumbar (lower back) region, using hands for support. The bend should be gradual and controlled, coming mainly from the lower back. Hold the position for 10-30 seconds while breathing normally. Inhale and slowly come back to upright position, head coming up last. Benefits: Creates flexibility in the spine, particularly in the lumbar region. Strengthens spinal nerves and muscles. Helps manage cervical spondylosis. Opens chest and improves breathing. Strengthens back muscles preventing slouching. Hypertensive patients should bend backward with great care and only minimally. Never force backward bend. Start with small movements and gradually increase range. Always support lower back with hands to prevent strain. This pose counteracts the forward-bent posture many people maintain throughout the day.",
    "precautions": "Precautions: Those suffering from vertigo or giddiness should avoid this practice."
  },
  {
    "id": "yoga_081",
    "title": "Trikonasana - Triangle Posture Complete Technique",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Standing Yogasanas",
    "info": "Trikonasana is a fundamental standing pose with lateral bending. Starting position: Samasthiti with feet approximately 3 feet apart. Inhale and raise both arms sideways to shoulder level, palms facing down. Turn right foot completely to the right at 90 degrees. Exhale and bend body to the right side, placing right hand behind the right foot on the ground. If unable to reach ground, place hand on ankle or shin. Left arm extends straight up in line with right arm, creating one straight line from left hand to right hand. Turn head to gaze at the left middle finger. Hold position for 10-30 seconds, breathing normally. Inhale and come up to standing. Repeat entire sequence on the left side. Benefits: Creates flexibility in the spine through lateral bending. Strengthens calf muscles, thighs, and waist. Improves lung capacity. Massages and tones abdominal organs. Do not over-stretch - if feet are too far apart, bring them closer or touch knee instead of foot. Those with neck problems should look forward instead of up.",
    "precautions": "Precautions: Avoid for slipped disc, sciatica, or after recent abdominal surgery."
  },
  {
    "id": "yoga_082",
    "title": "Vajrasana - Thunderbolt Posture for Meditation and Digestion",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Sitting Yogasanas",
    "info": "Vajrasana is a stable kneeling posture with unique digestive benefits. Starting from Virmsana (long sitting), fold both legs under the buttocks. Big toes should touch each other while heels remain apart, creating a space for buttocks to rest in between the heels. Rest both hands on the knees, palms facing down. Keep spine completely erect, head and neck straight. Eyes may be open or closed. Hold position for 10-30 seconds initially, gradually increasing duration. Benefits: Unique among asanas as it can be practiced immediately after eating - it aids digestion. Strengthens thigh and calf muscles. Improves blood circulation in pelvic region. Reduces fat around belly. Helps alleviate digestive disorders. Provides stable base for meditation and pranayama. If ankles hurt, place soft cloth under them. Regular practice gradually increases flexibility making the pose more comfortable. Vajra means thunderbolt, indicating the strength and stability this pose creates.",
    "precautions": "Precautions: Those suffering from piles, knee pain, ankle injury, or severe arthritis should avoid."
  },
  {
    "id": "yoga_083",
    "title": "Ustrasana - Camel Posture for Heart and Spine",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Sitting Yogasanas",
    "info": "Ustrasana is an intense backward bending posture performed from kneeling. Starting from Vajrasana, stand on the knees with feet slightly apart. Inhale and arch backward, placing both palms on respective heels. Exhale and ensure thighs are vertical to the ground while head drops back comfortably. Chest pushes forward and upward creating maximum arch in the back. Hold position for 10-30 seconds with normal breathing. To release, slowly come up by removing hands from heels one at a time. Benefits: Helps correct defective eyesight by improving blood circulation to eyes. Relieves back and neck pain by strengthening spinal muscles. Reduces abdominal fat through compression and stretching of abdomen. Improves digestion by massaging abdominal organs. Enhances cardio-respiratory function by opening chest. Stimulates thyroid gland. Increases flexibility of entire spine. Those with high blood pressure should practice only under expert supervision. Pregnant women should avoid. Never force into the full pose - progress gradually over weeks and months of regular practice.",
    "precautions": "Precautions: Those with heart disease or hernia should strictly avoid."
  },
  {
    "id": "yoga_084",
    "title": "Vakrasana - Spinal Twist Posture for Detoxification",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Sitting Yogasanas",
    "info": "Vakrasana, also known as Marchysana, is a seated spinal twist with cleansing properties. Starting from Dandsana (staff pose with legs extended), bend the right leg and place right foot flat beside the left knee. Twist torso to the right. Bring left arm around the outside of right knee, clasping the right big toe or placing palm on floor near right hip. Place right hand on the floor behind the body, fingers pointing back. Exhale and twist further to the right, looking over right shoulder. Hold 10-30 seconds, breathing normally. Release and repeat on opposite side. Benefits: Creates excellent flexibility in the spine through rotation. Stimulates pancreas, making it beneficial for diabetes management. Massages abdominal organs improving digestion. Relieves constipation. Strengthens oblique muscles. Improves liver and spleen function. Detoxifies body by wringing out spine like a wet towel. Women should avoid during menstruation. Always twist from the belly, not just shoulders. Keep spine elongated throughout the twist - never collapse or compress the spine.",
    "precautions": "Precautions: Avoid for acute back pain, spinal disorders, or recent abdominal surgery."
  },
  {
    "id": "yoga_085",
    "title": "Bhujangasana - Cobra Posture Comprehensive Guide",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Prone Yogasanas",
    "info": "Bhujangasana is a foundational prone backbend resembling a cobra raising its hood. Starting from Makarsana (crocodile pose), bring legs together with feet touching. Place hands beside chest, palms down, elbows raised and close to body. Inhale and slowly lift head, neck, and chest using back strength primarily, not pushing heavily with arms. Lift chest up to navel region, keeping navel on ground. Draw shoulders back and down, opening chest. Look upward gently without straining neck. Hold 10-30 seconds, breathing normally. Exhale and slowly lower chest, then head. Benefits: Relieves stress and fatigue by opening chest and heart. Alleviates constipation through abdominal massage. Reduces abdominal fat. Helpful for backache by strengthening back muscles. Beneficial for bronchial problems and asthma by expanding lungs. Stimulates abdominal organs. Improves blood circulation to spine. Those with hernia, peptic ulcers, or hyperthyroid should not practice. Pregnant women should avoid. The lift should come from back strength, not arm strength - this is key to gaining benefit without strain.",
    "precautions": "Precautions: Avoid for 2-3 months after abdominal surgery."
  },
  {
    "id": "yoga_086",
    "title": "Shalabhasana - Locust Posture for Lower Body Strength",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Prone Yogasanas",
    "info": "Shalabhasana strengthens the entire posterior chain of the body. Starting from Makarsana, place chin on floor instead of forehead. Straighten arms and place them beside the body, palms facing down or in fists. Legs remain straight and together. Inhale deeply and raise both legs off the ground without bending knees, lifting as high as comfortably possible. Keep chin firmly on floor for leverage. Hold position 10-30 seconds while breathing naturally. Exhale and slowly lower legs. Benefits: Excellent for sciatica and lower backache. Reduces fat around thighs and buttocks. Significantly improves lung capacity. Strengthens back, hip, and leg muscles. Tones abdominal organs. Improves digestion. Helps correct postural defects. Avoid entirely for high blood pressure, peptic ulcer, or hernia. Pregnant women should not practice. The lift should be smooth and controlled - avoid jerky movements. This challenging pose builds both strength and endurance when practiced regularly.",
    "precautions": "Precautions: Those with severe lower back pain should practice with caution, perhaps lifting one leg at a time."
  },
  {
    "id": "yoga_087",
    "title": "Setubandhasana - Bridge Posture for Back Health",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Supine Yogasanas",
    "info": "Setubandhasana creates a bridge shape with the body, offering multiple benefits. Starting from avsana (corpse pose), bend both knees and bring heels close to buttocks, feet flat on floor hip-width apart. Hold ankles with respective hands, or keep arms beside body. Inhale and raise buttocks and trunk off the ground, creating a bridge shape with the body. Only shoulders, head, feet, and arms remain on ground. Push hips up as high as comfortable. Hold 10-30 seconds, breathing normally. Exhale and slowly lower back down, vertebra by vertebra. Benefits: Helps alleviate depression and anxiety by opening heart center. Strengthens lower back muscles. Improves digestion by massaging abdominal organs. Stretches chest, neck, and spine. Therapeutic for mild backache. Reduces stress and fatigue. Stimulates thyroid, lungs, and abdominal organs. Those with neck injuries should practice only under expert guidance or avoid. This pose can be practiced by placing a block under sacrum for a more restorative version. Regular practice strengthens entire posterior chain of body.",
    "precautions": "Precautions: Avoid for ulcer or hernia."
  },
  {
    "id": "yoga_088",
    "title": "Pavanamuktasana - Wind Releasing Posture for Digestive Health",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Supine Yogasanas",
    "info": "Pavanamuktasana specifically targets digestive issues and intestinal health. Starting from avsana, bend both knees and bring them toward chest. Clasp arms around shins, hugging knees close to body. Exhale and raise head off ground, bringing chin toward knees or touching forehead to knees if possible. Entire spine should curl up in a compact position. Hold 10-30 seconds while breathing normally, feeling compression on abdomen. Release head first, then arms, and gently lower legs. Benefits: Highly effective for constipation and flatulence. Releases trapped gas from intestines. Improves overall digestion. Strengthens abdominal muscles. Massages entire abdominal region. Strengthens spinal nerves. Tones muscles of arms and legs. Reduces fat around buttocks and thighs. The compression on abdomen makes this pose very powerful for digestive issues but also means it must be avoided when abdomen is vulnerable. The name Pavana means wind and Mukta means release, perfectly describing its primary function.",
    "precautions": "Precautions: Strictly avoid for abdominal injuries, hernia, sciatica, severe back pain, slipped disc, or during pregnancy."
  },
  {
    "id": "yoga_089",
    "title": "Shavasana - Corpse Posture for Complete Relaxation",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Supine Yogasanas",
    "info": "Shavasana is the ultimate relaxation pose, concluding every yoga practice. Lie flat on back in supine position. Place arms and legs slightly apart from body for comfort - arms about 15 degrees from torso, legs comfortably separated. Turn palms facing upward in receptive position. Close eyes gently. Consciously relax every part of body starting from toes and moving upward through legs, abdomen, chest, arms, shoulders, neck, face, and head. Relax facial muscles especially - forehead, eyes, jaw. Breathe slowly and shallowly, allowing breath to become very subtle. Let go of all physical and mental tension. Remain in complete stillness for 5-15 minutes. To come out, gently deepen breath, move fingers and toes, stretch arms overhead, roll to right side, and slowly sit up. Benefits: Relieves overall bodily tension and mental stress. Activates parasympathetic nervous system promoting rest and healing. Lowers blood pressure and heart rate. Allows integration of practice benefits. Essential for stress management. Despite appearing simple, Shavasana is considered one of the most challenging poses because the mind resists complete stillness. Yet it is also one of the most important practices in yoga.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_090",
    "title": "Kapalabhati - Frontal Brain Cleansing Breath Detailed",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Kriya (Cleansing Practices)",
    "info": "Kapalabhati is a powerful cleansing breath technique that purifies the respiratory system. Sit in any comfortable meditative posture with spine erect. Take a deep inhalation to prepare. Then forcefully expel breath through both nostrils using rapid contraction of abdominal muscles. The exhalation should be short, quick, and forceful. Inhalation between exhalations is passive and automatic - simply release the abdomen and air flows in naturally. Focus entirely on forceful exhalations. Count 30 rapid breaths to complete one round. Take a break with normal breathing between rounds. Practice total of 3 rounds, gradually increasing count to 60 per round with regular practice. Benefits: Purifies frontal sinuses and entire nasal passage. Excellent for cough, asthma, sinusitis, allergies. Rejuvenates entire body by increasing oxygen supply. Strengthens abdominal muscles and diaphragm. Improves digestion. Increases concentration and mental clarity. Removes toxins from blood. Stop immediately if feeling dizzy. This is a heating, energizing practice best done in morning. Kapalabhati means skull shining, referring to the clarity it brings to mind.",
    "precautions": "Precautions: Strictly avoid for cardiac conditions, high blood pressure, vertigo, hernia, gastric ulcer, pregnancy, menstruation, stroke, epilepsy."
  },
  {
    "id": "yoga_091",
    "title": "Nadi Shodhana - Alternate Nostril Breathing Complete Technique",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Pranayama",
    "info": "Nadi Shodhana, also called Anuloma Viloma, purifies energy channels and balances brain hemispheres. Sit in comfortable meditative posture with spine erect. Place left hand in Jnana Mudra on left knee (index finger and thumb touching). Form Nasagra Mudra with right hand: fold index and middle fingers toward palm, using thumb to close right nostril and ring finger to close left nostril. Close right nostril with thumb and inhale slowly through left nostril. At end of inhalation, close left nostril with ring finger and release thumb to exhale through right nostril. Immediately inhale through right nostril. Close right nostril and exhale through left. This completes one full round. Continue for 5 rounds initially, gradually increasing to 10-15 minutes. Initially maintain equal duration for inhalation and exhalation. With practice, gradually establish 1:2 ratio (exhalation twice as long as inhalation). Benefits: Creates profound tranquility and improves concentration. Excellent for managing stress and anxiety. Balances left (logical) and right (creative) brain hemispheres. Purifies nadis (energy channels). Prepares mind perfectly for meditation. This is one of the safest and most beneficial pranayama practices suitable for almost everyone.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_092",
    "title": "Shitali Pranayama - Cooling Breath for Heat Management",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Pranayama",
    "info": "Shitali Pranayama is a cooling breath technique that reduces internal heat. Sit in Padmsana or any comfortable meditative posture. Roll tongue lengthwise into a tube shape, extending tongue slightly beyond lips. If unable to roll tongue (genetic trait), form 'O' shape with lips. Inhale slowly and deeply through the rolled tongue or pursed lips, feeling cool air flow in. After complete inhalation, close mouth and exhale slowly through both nostrils. This completes one round. Repeat for 5 rounds initially, gradually increasing duration. Benefits: Powerfully cools body and mind, making it ideal for hot weather or after heating practices. Beneficial for high blood pressure. Quenches thirst more effectively than drinking water. Improves digestion and reduces acidity. Reduces inflammation in body. Purifies blood. Calms nervous system. Not suitable for practice in very cold weather. This practice demonstrates yoga's sophisticated understanding of breath's ability to regulate body temperature and internal states. The name Shitali means cooling, perfectly describing the technique's primary effect.",
    "precautions": "Precautions: Avoid for severe cold, cough, tonsillitis, or respiratory infections."
  },
  {
    "id": "yoga_093",
    "title": "Dhyana - Meditation Practice for Inner Peace",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Meditation",
    "info": "Dhyana or meditation is the pinnacle of yoga practice, leading to self-realization. Sit in meditation posture - Padmasana, Sukhasana, or any comfortable cross-legged position with spine naturally erect. Form Dhyana Mudra with hands: rest hands in lap, right hand on left, palms facing up, thumbs lightly touching. Close eyes and direct inner gaze toward space between eyebrows (Ajna chakra). Begin by observing thoughts without judgment or engagement. Gradually allow thoughts to dissolve, creating gaps of pure awareness between thoughts. Eventually attain state of single pure thought or thoughtless awareness. Start with 5-10 minutes and gradually increase duration. Benefits: Eliminates negative emotions like anger, fear, greed, and jealousy. Dramatically improves concentration and memory. Strengthens willpower and determination. Reduces stress, anxiety, and depression. Enhances creativity and problem-solving. Creates profound inner peace. Improves overall mental health and emotional stability. Regular practice leads to self-knowledge and spiritual awakening. Meditation is not about stopping thoughts forcefully but about developing witness consciousness - the ability to observe mind without being controlled by it. This is the essence of yoga.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_094",
    "title": "Sankalpa - Positive Resolve for Personal Growth",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Closing Protocol",
    "info": "Sankalpa is a positive resolve or intention stated at the conclusion of practice to embed its benefits in daily life. After completing asanas, pranayama, and meditation, while still in a relaxed and receptive state, silently state your Sankalpa. The Common Yoga Protocol recommends this Sankalpa: I commit myself to maintaining a balanced state of mind at all times. It is in this state that my growth reaches its fullest potential. I pledge to fulfill my responsibilities to myself, family, work, society, and the world to promote peace, health, and harmony. A Sankalpa should be: Brief and clear, stated in present tense as if already true, emotionally resonant and meaningful to you personally, repeated consistently. The deep relaxation after practice makes the mind highly receptive to positive suggestions. Regular practice of Sankalpa creates profound changes by aligning subconscious mind with conscious goals. This ancient technique recognizes that true change begins in the mind and radiates outward into actions and life circumstances. Sankalpa plants seeds of transformation that grow through consistent practice.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_095",
    "title": "Shanti Patha - Peace Invocation for Universal Wellbeing",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Closing Protocol",
    "info": "Shanti Patha or Peace Chant concludes yoga practice by extending wishes of wellbeing to all beings. After Sankalpa, chant or silently repeat: Om Sarve Bhavantu Sukhina, Sarve Santu Nirmay. Sarve Bhadri Payantu, M kacit Dukha Bhgbhavet. Om nti nti nti. Translation: May All become Happy, May All be Free from Illness. May All See what is Auspicious, May No One Suffer. Om Peace, Peace, Peace. The three repetitions of Shanti represent peace in three dimensions: Adhibhautika (peace with external world and other beings), Adhidaivika (peace with forces of nature and divine), Adhyatmika (inner peace within oneself). This chant embodies yoga's fundamental principle that individual wellbeing is interconnected with universal wellbeing. By wishing happiness and freedom from suffering for all beings, we transcend ego boundaries and align with highest yogic ideals of compassion and unity. Regular practice of this chant cultivates genuine benevolence and reminds us that our practice serves not just personal goals but contributes to collective peace and harmony. This is the true spirit of yoga.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_096",
    "title": "Yoga During Pregnancy - Safe Practices and Modifications",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Special Conditions",
    "info": "Pregnancy requires special considerations for yoga practice. General guidelines: Always practice under guidance of qualified prenatal yoga instructor. Consult doctor before beginning or continuing practice. Listen to body and never force or strain. Safe practices during pregnancy: Gentle breathing exercises (avoid breath retention), Pelvic floor exercises, Cat-Cow stretches, Modified standing poses with wall support, Gentle hip openers like Bhadrasana, Supported resting poses. Practices to AVOID during pregnancy: All inversions including headstand and shoulder stand, Deep twists especially closed twists, Strong backbends, Poses lying on belly after first trimester, Poses lying flat on back after second trimester, Breath retention (Kumbhaka), Kapalabhati and Bhastrika, Deep forward bends that compress abdomen, Jumping or jerky movements. Benefits of safe prenatal yoga: Prepares body for childbirth, Strengthens pelvic floor, Reduces back pain, Improves circulation, Reduces stress and anxiety, Promotes better sleep, Helps maintain healthy weight. Each trimester has different needs - first trimester requires extra caution, second trimester allows more activity, third trimester needs maximum modification. Always inform instructor about pregnancy stage and any complications.",
    "precautions": "Consult a healthcare provider before practicing if you have any medical conditions."
  },
  {
    "id": "yoga_097",
    "title": "Yoga with High Blood Pressure - Safe Practice Guidelines",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Special Conditions",
    "info": "High blood pressure (hypertension) requires careful yoga practice with specific modifications. Safe practices for hypertension: Gentle forward bends (seated, not standing), Supported resting poses like Shavasana, Legs-up-the-wall with support, Gentle twists, Slow deep breathing, Alternate nostril breathing, Meditation and relaxation techniques. Practices to AVOID with high blood pressure: All inversions (headstand, shoulder stand, downward dog held long), Breath retention, especially after inhalation, Kapalabhati and Bhastrika pranayama, Intense backbends, Holding poses for long duration, Any practice that causes strain or breathlessness, Competitive or goal-oriented practice. Important Benefits when practiced correctly: Reduces stress which elevates blood pressure, Improves cardiovascular health, Enhances relaxation response, May reduce medication needs over time (under medical supervision), Improves overall quality of life. Yoga should complement, not replace, medical treatment for hypertension.",
    "precautions": "precautions: Practice only when blood pressure is under control with medication, Never stop medication without doctor consultation, Monitor blood pressure regularly, Inform yoga teacher about condition, Stop immediately if feeling dizzy, lightheaded, or having headache, Avoid early morning practice if BP is poorly controlled."
  },
  {
    "id": "yoga_098",
    "title": "Yoga with Heart Conditions - Essential Safety Precautions",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Special Conditions",
    "info": "Cardiac conditions require extra caution and medical clearance for yoga practice. Essential Safe practices with cardiac conditions: Gentle breathing exercises without retention, Slow movements with emphasis on exhalation, Supported relaxation poses, Gentle stretches, Meditation and visualization, Shavasana with upper body elevated if needed. Practices to STRICTLY AVOID: All inversions, Breath retention (Kumbhaka), Intense physical poses, Valsalva maneuver (bearing down), Kapalabhati and Bhastrika, Intense backbends, Any practice causing strain or breathlessness, Competitive practice, Hot yoga or heated rooms. Specific conditions require specific approaches: Recent heart attack - wait minimum 6 months, under cardiologist supervision, Angina - extremely gentle practice only, Heart failure - consult cardiologist, may need oxygen monitoring, Arrhythmias - avoid stimulating practices. Benefits when practiced safely: Reduces stress on heart, Improves circulation gently, Enhances parasympathetic tone, Supports cardiac rehabilitation, Improves quality of life. Cardiac yoga therapy programs under medical supervision show good results.",
    "precautions": "precautions: Obtain doctor's written clearance before starting, Practice only under qualified instructor experienced with cardiac conditions, Keep doctor informed about your practice, Monitor heart rate during practice, Stop immediately if experiencing chest pain, excessive breathlessness, dizziness, or irregular heartbeat."
  },
  {
    "id": "yoga_099",
    "title": "Yoga with Spinal Problems - Disc Issues and Back Pain",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Special Conditions",
    "info": "Spinal disorders including herniated discs, sciatica, and chronic back pain require careful practice. Safe practices for back problems: Gentle spinal movements within pain-free range, Cat-Cow stretches (very gentle), Pelvic tilts, Knee-to-chest pose (one leg at a time), Supported Child's pose, Supine twists (gentle), Relaxation practices, Breathing exercises. Practices to AVOID with spinal problems: Deep forward bends, especially standing ones, Intense twists, Strong backbends, Inversions (depending on condition), Leg raises (if sciatica), Poses that cause pain or tingling, Any jerky movements. Specific conditions: Herniated disc - avoid all forward bends and twists initially, Sciatica - avoid forward bends, practice gentle hip openers, Spinal stenosis - avoid backbends, forward bends may feel better, Spondylolisthesis - avoid backbends and twists, Chronic lower back pain - strengthen core, gentle movements only. Important principles: Pain is a signal to stop - never push through pain, Tingling or numbness requires immediate stop, Strengthen core muscles to support spine, Start with physical therapy or yoga therapy evaluation, Progress very gradually, Be patient with healing process. Benefits of appropriate practice: Reduces pain over time, Improves flexibility carefully, Strengthens supporting muscles, Enhances body awareness, Provides pain management tools, Improves quality of life. Work with qualified yoga therapist or instructor experienced with back problems.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  },
  {
    "id": "yoga_100",
    "title": "Yoga During Menstruation - Traditional Guidelines and Modern Approaches",
    "source": "Common Yoga Protocol - Ministry of Ayush, Government of India",
    "page": "Special Conditions",
    "info": "Menstruation requires honoring the body's natural cycle with appropriate modifications. Traditional approach: Avoid inversions during menstruation, Avoid strong abdominal work, Avoid intense backbends, Reduce overall intensity of practice, Focus on restorative and gentle practices. Reasoning behind restrictions: Inversions may interfere with natural downward flow (Apana Vayu), Intense practice may increase bleeding, Rest supports body's cleansing process. Safe practices during menstruation: Gentle forward bends (opening hips), Supported resting poses, Gentle twists, Hip openers like Bhadrasana and Butterfly, Legs-up-the-wall (though traditionally avoided as inversion, many find it helpful), Gentle breathing practices, Meditation and relaxation, Yin yoga style holds. Modern perspective: Many women practice normally during menstruation without issues, Individual experience varies greatly, Listen to your body above all rules, If feeling well, gentle inversions may be okay, If experiencing cramps, rest and restorative practice is wise. Benefits of appropriate practice during menstruation: Reduces menstrual cramps, Relieves back pain, Reduces bloating, Improves mood, Manages PMS symptoms, Promotes hormonal balance. Each woman's experience is unique - honor what your body needs. Some days may allow more active practice, other days require complete rest. Yoga teaches us to be attuned to body's changing needs.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort."
  }
]